{
  "questions":
 [
  {
      "id": 1,
      "ask": "Câu nào sai trong các câu dưới đây?",
      "op1": "Mỗi bảng có ít nhất một khóa",
      "op2": "Nên chọn khóa chính là khóa có ít thuộc tính nhất",
      "op3": "Trong một bảng có thể có nhiều khóa chính",
      "op4": "Việc xác định khóa phụ thuộc vào quan hệ logic của các dữ liệu chứ không phụ thuộc vào giá trị các dữ liệu",
      "result": "c"
    },
  {
      "id": 2,
      "ask": "Khẳng định nào sau đây về CSDL quan hệ là đúng?",
      "op1": "Tập hợp các bảng dữ liệu",
      "op2": "Cơ sở dữ liệu được tạo ra từ hệ QTCSDL Access",
      "op3": "Cơ sở dữ liệu mà giữa các dữ liệu có quan hệ với nhau",
      "op4": "Cơ sở dữ liệu được xây dựng trên mô hình dữ liệu quan hệ",
      "result": "d"
    },
	{
      "id": 3,
      "ask": "Câu nào sai trong các câu dưới đây khi nói về ưu điểm của hệ CSDL khách-chủ?",
      "op1": "Chi phí cho truyền thông giảm",
      "op2": "Bổ sung thêm máy khách là dễ dàng",
      "op3": "Phát triển và sử dụng các hệ CSDL khách-chủ khá đơn giản, dễ dàng",
      "op4": "Nâng cao khả năng đảm bảo tính nhất quán của dữ liệu",
      "result": "c"
    },
	{
      "id": 4,
      "ask": " Liên kết giữa các bảng được dựa trên:",
      "op1": "Thuộc tính khóa",
      "op2": "Các thuộc tính trùng tên nhau giữa các bảng",
      "op3": "Ý định của người quản trị hệ CSDL",
      "op4": "Ý định ghép các bảng thành một bảng có nhiều thuộc tính hơn",
      "result": "a"
    },
	{
      "id": 5,
      "ask": "Thế nào là cơ sở dữ liệu quan hệ?",
      "op1": "Cơ sở dữ liệu được xây dựng dựa trên mô hình dữ liệu quan hệ",
      "op2": "Cơ sở dữ liệu dùng để tạo lập, cập nhật và khai thác CSDL quan hệ",
      "op3": "Cơ sở dữ liệu được xây dựng dựa trên mô hình dữ liệu quan hệ và khai thác CSDL quan hệ",
      "op4": "Cơ sở dữ liệu dùng để tạo lập, cập nhật và khai thác CSDL quan hệ dựa trên mô hình dữ liệu quan hệ",
      "result": "a"
    },
	{
      "id": 6,
      "ask": "Tiêu chí nào sau đây thường được dùng để chọn khóa chính?",
      "op1": "Khóa có ít thuộc tính nhất",
      "op2": "Không chứa các thuộc tính thay đổi theo thời gian",
      "op3": "Khóa bất kì",
      "op4": "Chỉ là khóa có một thuộc tính",
      "result": "a"
    },
	{
      "id": 7,
      "ask": "Câu nào trong các câu dưới đây sai khi nói về hệ CSDL cá nhân?",
      "op1": "Người dùng đóng vai trò là người quản trị CSDL",
      "op2": "Tính an toàn của hệ CSDL cá nhân rất cao",
      "op3": "Hệ CSDL cá nhân được lưu trữ trên 1 máy",
      "op4": "Hệ CSDL chỉ cho phép 1 người dùng tại một thời điểm",
      "result": "b"
    },
	{
      "id": 8,
      "ask": "Hãy chọn phương án đúng. Hai bảng trong một CSDL quan hệ liên kết với nhau thông qua:",
      "op1": "Địa chỉ của các bảng",
      "op2": "Tên trường",
      "op3": "Thuộc tính của các trường được chọn (không nhất thiết phải là khóa)",
      "op4": "Thuộc tính khóa",
      "result": "d"
    },
	{
      "id": 9,
      "ask": "Câu nào trong các câu dưới đây sai khi nói về hệ CSDL khách-chủ?",
      "op1": "Trong kiến trúc khách-chủ, các thành phần (của hệ QTCSDL) tương tác với nhau tạo nên hệ thống gồm thành phần yêu cầu tài nguyên và thành phần cấp tài nguyên",
      "op2": "Hai thành phần yêu cầu tài nguyên và thành phần cấp tài nguyên phải cài đặt trên cùng một máy tính",
      "op3": "Thành phần cấp tài nguyên thường được cài đặt tại một máy chủ trên mạng (cục bộ)",
      "op4": "Thành phần yêu cầu tài nguyên có thể cài đặt tại nhiều máy khác (máy khách) trên mạng",
      "result": "b"
    },
	{
      "id": 10,
      "ask": " Trường khóa chính là trường:",
      "op1": "Single Key",
      "op2": "Unique Key",
      "op3": "First Key",
      "op4": "Primary Key",
      "result": "d"
    },
	{
      "id": 11,
      "ask": "Cho bảng NHANVIEN(MANV, TENNV, LCB). Muốn kiểm tra xem tiền lương của tất cả nhân viên trong trường hợp lương cơ bản tăng 10%, chúng ta sẽ dùng câu lệnh nào dưới đây?",
      "op1": "Select MANV, TENNV, LCB*.10 from NHANVIEN",
      "op2": "Select MANV, TENNV, LCB+LCB*.01 from NHANVIEN",
      "op3": "Select MANV, TENNV, LCB+LCB*.10 from NHANVIEN",
      "op4": "Select MANV, TENNV, LCB+10 from NHANVIEN",
      "result": "c"
    },
	{
      "id": 12,
      "ask": "Để chọn tất cả các cột và liệt kê tất cả các hàng từ bảng VATTU có thuộc tính LOAIVT (kiểu số) là 1, ta dùng câu lệnh nào sau đây là đúng nhất?",
      "op1": "SELECT * FROM VATTU WHERE LOAIVT = 1",
      "op2": "SELECT * FROM VATTU WHERE GroupID = 1",
      "op3": "SELECT LOAIVT FROM VATTU WHERE LOAIVT = 1",
      "op4": "SELECT LOAIVT FROM VATTU WHERE LOAIVT = 1",
      "result": "a"
    },
	{
      "id": 13,
      "ask": "Câu lệnh nào được dùng để tính tổng số dòng trong bảng NHANVIEN?",
      "op1": "Select rowcount from NHANVIEN",
      "op2": "Select sum(*) from NHANVIEN",
      "op3": "Select count(*) from NHANVIEN",
      "op4": "Select count_rows from NHANVIEN",
      "result": "c"
    },
	{
      "id": 14,
      "ask": "Kết nối bằng nhau các quan hệ theo thuộc tính là:",
      "op1": "Thực hiện tích Đề Các và phép chọn",
      "op2": "Thực hiện tích Đề Các và phép chiếu",
      "op3": "Thực hiện phép chiếu và chia",
      "op4": "Thực hiện tích Đề Các và phép chia",
      "result": "a"
    },
	{
      "id": 15,
      "ask": "Phép xóa (Delete) là phép toán",
      "op1": "Xóa một thuộc tính hay xóa một nhóm các thuộc tính",
      "op2": "Xóa một bộ hay xóa một nhóm các bộ",
      "op3": "Xóa một quan hệ trong cơ sở dữ liệu",
      "op4": "Xóa một cột hoặc nhiều cột",
      "result": "b"
    },
	{
      "id": 16,
      "ask": "Tại sao khóa chính không cho phép có giá trị NULL?",
      "op1": "Khó xác định tính duy nhất của các hàng",
      "op2": "Khó xác định tính duy nhất của các cột",
      "op3": "Khó kết nối các bảng",
      "op4": "Khó xác định khóa ngoại",
      "result": "a"
    },
	{
      "id": 17,
      "ask": " Hãy chọn từ/cụm từ tương ứng để hoàn thiện khẳng định sau: Từ một nhóm các siêu khóa cho trước, có thể...",
      "op1": "Xác định một khóa chính trong đó",
      "op2": "Không thể xác định một khóa chính trong đó",
      "op3": "Xác định một nhóm các thuộc tính",
      "op4": "Xác định một thuộc tính bất kỳ",
      "result": "a"
    },
	{
      "id": 18,
      "ask": "Liên kết giữa 2 bảng được dựa trên:",
      "op1": "Các thuộc tính trùng tên nhau giữa các bảng",
      "op2": "Khóa chính và khóa ngoại",
      "op3": "Ý định của người quản trị cơ sở dữ liệu",
      "op4": "Ý định ghép các bảng thành một bảng có nhiều thuộc tính hơn",
      "result": "b"
    },
	{
      "id": 19,
      "ask": "Các thành phần chính trong mô hình thực thể kết hợp gồm:",
      "op1": "Bảng số, thực thể và quan hệ.",
      "op2": "Thực thể kết hợp, quan hệ, ràng buộc",
      "op3": "Ràng buộc các thực thể, mối kết hợp và bảng số.",
      "op4": "Thực thể, mối kết hợp và bảng số.",
      "result": "d"
    },
	{
      "id": 20,
      "ask": " Đâu không phải các bước trong xây dựng cơ sở dữ liệu?",
      "op1": "Thiết kế.",
      "op2": "Khảo sát.",
      "op3": "Chạy thử.",
      "op4": "Ký hợp đồng.",
      "result": "d"
    }
]
}